# 已知摩尔斯电码和字符映射关系如下：
# A -> 0
# B -> 1
# C -> 10
# D -> 11
# E -> 100
# F -> 101
# G -> 110
# H -> 111
# 当前我们获取到了一串01数字字符串，需要进行摩尔斯电码解码，请问共有多少种解码方法？
# 输入描述:
# 一行由0和1组成的字符串
# 输出描述:
# 一行一个数字表示答案，即解码方法数量
# 输入例子1:
# 11
# 输出例子1:
# 2
# 例子说明1:
# 有D和BB两种解法
# 输入例子2:
# 100
# 输出例子2:
# 3
# 例子说明2:
# 有E,BAA和CA三种解法
s = input().strip()
dp = [0] * (len(s)+1)
dp[0] = 1
dp[1] = 1
s1 = s[::-1]
print(s1)
for i in range(2, len(s)+1):
    if i > 2:
        if s1[i-3:i][::-1] in ['110', '111', '101', '100']:
            dp[i] += dp[i-3]
        if s1[i-2:i][::-1] in ['10', '11']:
            dp[i] += dp[i-2]
        dp[i] += dp[i-1]
    elif i > 1:
        if s1[i-2:i][::-1] in ['10', '11']:
            dp[i] += dp[i-2]
        dp[i] += dp[i-1]
print(dp)
print(dp[-1]%(2**32))